trade_exp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4ed96c3e-4885-4c35-b010-4d22e1d10826">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonForms/СозданиеНаОснованииУточнениеЗаказываемогоКоличества/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура Док_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
	
	ДействияСтрока = НСтр("ru = 'Все'");
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.КОбеспечению,
		Перечисления.ВариантыОбеспечения.КОбеспечению, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления,
		Перечисления.ВариантыОбеспечения.РезервироватьПоМереПоступления, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить,
		Перечисления.ВариантыОбеспечения.Отгрузить, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.СоСклада,
		Перечисления.ВариантыОбеспечения.СоСклада, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.НеТребуется,
		Перечисления.ВариантыОбеспечения.НеТребуется, Истина);
	ДействияСписок.Добавить(Перечисления.ВариантыОбеспечения.ПереданРанее,
		Перечисления.ВариантыОбеспечения.ПереданРанее, Истина);
	ВосстановитьНастройки();
	#Вставка
	Имя = Параметры.ИмяМенеджераДокумента;
    Если (Имя = "ЗаказПоставщику" или Имя = "ЗаказНаПеремещение") и ТипЗнч(Параметры.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
        ВсеИзДокументаНеОбеспечено = 1;    
    КонецЕсли;
	#КонецВставки
	
	ЗаполнитьТоварыПоЗначениюПереключателяВсеИзДокументаНеОбеспечено();
КонецПроцедуры
